# BadBalustersPerTread Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..BadBalustersPerTread Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Number of Balusters per Tread must be an integer greater than zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadBalustersPerTread { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadBalustersPerTread As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadBalustersPerTread {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace